OpenFOAM-7/tutorials/multiphase/driftFluxFoam/RAS/mixerVessel2D/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (sludge water);

sludge
{
    transportModel  BinghamPlastic;

    "(plastic|BinghamPlastic)Coeffs"
    {
        coeff       0.00023143;
        exponent    179.26;

        BinghamCoeff    0.0005966;
        BinghamExponent 1050.8;
        BinghamOffset   0;

        muMax       10;
    }

    rho         1996;
}

water
{
    transportModel  Newtonian;

    nu              1.7871e-06;
    rho             996;
}

relativeVelocityModel simple;

"(simple|general)Coeffs"
{
    V0              (0 -0.002198 0);
    a               285.84;
    a1              0.1;
    residualAlpha   0;
}


// ************************************************************************* //
